[Killed] BlockStatement
src/index.ts:10:62
 
 type PlainObject = Record<string, unknown>;
 
-function isPlainObject(value: unknown): value is PlainObject {
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.getPrototypeOf(value) === Object.prototype
-  );
-}
+function isPlainObject(value: unknown): value is PlainObject {}
 
 function deepMerge(base: PlainObject, override: PlainObject): PlainObject {
killedBy: buildConfig lets later sources override earlier ones, deep-merged per key
statusReason: invalid configuration — server.baseUrl: Invalid input: expected string, received undefined

[Killed] ConditionalExpression
src/index.ts:12:5
 
 function isPlainObject(value: unknown): value is PlainObject {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.getPrototypeOf(value) === Object.prototype
+    false
   );
 }
killedBy: buildConfig lets later sources override earlier ones, deep-merged per key
statusReason: invalid configuration — server.baseUrl: Invalid input: expected string, received undefined

[Killed] EqualityOperator
src/index.ts:15:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.getPrototypeOf(value) === Object.prototype
+    Object.getPrototypeOf(value) !== Object.prototype
   );
 }
killedBy: buildConfig lets later sources override earlier ones, deep-merged per key
statusReason: invalid configuration — server.baseUrl: Invalid input: expected string, received undefined

[Survived] ConditionalExpression
src/index.ts:15:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.getPrototypeOf(value) === Object.prototype
+    true
   );
 }

[Killed] BlockStatement
src/index.ts:19:75
   );
 }
 
-function deepMerge(base: PlainObject, override: PlainObject): PlainObject {
-  const merged: PlainObject = { ...base };
-  for (const [key, value] of Object.entries(override)) {
-    const existing = merged[key];
-    merged[key] =
-      isPlainObject(existing) && isPlainObject(value)
-        ? deepMerge(existing, value)
-        : value;
-  }
-  return merged;
-}
+function deepMerge(base: PlainObject, override: PlainObject): PlainObject {}
 
 function deepFreeze<T>(value: T): T {
killedBy: buildConfig parses defaults into a typed config
statusReason: invalid configuration — : Invalid input: expected object, received undefined

[Killed] ObjectLiteral
src/index.ts:20:31
 }
 
 function deepMerge(base: PlainObject, override: PlainObject): PlainObject {
-  const merged: PlainObject = { ...base };
+  const merged: PlainObject = {};
   for (const [key, value] of Object.entries(override)) {
     const existing = merged[key];
killedBy: buildConfig lets later sources override earlier ones, deep-merged per key
statusReason: invalid configuration — server.baseUrl: Invalid input: expected string, received undefined; brand: Invalid input: expected object, received undefined

[Killed] BlockStatement
src/index.ts:21:56
 
 function deepMerge(base: PlainObject, override: PlainObject): PlainObject {
   const merged: PlainObject = { ...base };
-  for (const [key, value] of Object.entries(override)) {
-    const existing = merged[key];
-    merged[key] =
-      isPlainObject(existing) && isPlainObject(value)
-        ? deepMerge(existing, value)
-        : value;
-  }
+  for (const [key, value] of Object.entries(override)) {}
   return merged;
 }
killedBy: buildConfig parses defaults into a typed config
statusReason: invalid configuration — server: Invalid input: expected object, received undefined; brand: Invalid input: expected object, received undefined

[Killed] ConditionalExpression
src/index.ts:24:7
   for (const [key, value] of Object.entries(override)) {
     const existing = merged[key];
     merged[key] =
-      isPlainObject(existing) && isPlainObject(value)
+      false
         ? deepMerge(existing, value)
         : value;
killedBy: buildConfig lets later sources override earlier ones, deep-merged per key
statusReason: invalid configuration — server.baseUrl: Invalid input: expected string, received undefined

[Survived] LogicalOperator
src/index.ts:24:7
   for (const [key, value] of Object.entries(override)) {
     const existing = merged[key];
     merged[key] =
-      isPlainObject(existing) && isPlainObject(value)
+      isPlainObject(existing) || isPlainObject(value)
         ? deepMerge(existing, value)
         : value;

[Killed] BlockStatement
src/index.ts:31:37
   return merged;
 }
 
-function deepFreeze<T>(value: T): T {
-  if (typeof value === 'object' && value !== null) {
-    for (const child of Object.values(value)) {
-      deepFreeze(child);
-    }
-    Object.freeze(value);
-  }
-  return value;
-}
+function deepFreeze<T>(value: T): T {}
 
 /**
killedBy: buildConfig parses defaults into a typed config
statusReason: Cannot read properties of undefined (reading 'server')

[Killed] ConditionalExpression
src/index.ts:32:7
 }
 
 function deepFreeze<T>(value: T): T {
-  if (typeof value === 'object' && value !== null) {
+  if (false) {
     for (const child of Object.values(value)) {
       deepFreeze(child);
killedBy: buildConfig returns a deeply frozen object
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/index.ts:32:7
 }
 
 function deepFreeze<T>(value: T): T {
-  if (typeof value === 'object' && value !== null) {
+  if (typeof value === 'object' || value !== null) {
     for (const child of Object.values(value)) {
       deepFreeze(child);
killedBy: buildConfig parses defaults into a typed config
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/index.ts:33:47
 
 function deepFreeze<T>(value: T): T {
   if (typeof value === 'object' && value !== null) {
-    for (const child of Object.values(value)) {
-      deepFreeze(child);
-    }
+    for (const child of Object.values(value)) {}
     Object.freeze(value);
   }
killedBy: buildConfig returns a deeply frozen object
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/index.ts:50:31
 export function buildConfig<TSchema extends z.ZodType>(
   schema: TSchema,
   sources: readonly PlainObject[],
-): Readonly<z.infer<TSchema>> {
-  const merged = sources.reduce<PlainObject>(
-    (accumulated, source) => deepMerge(accumulated, source),
-    {},
-  );
-  const result = schema.safeParse(merged);
-  if (!result.success) {
-    const details = result.error.issues
-      .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
-      .join('; ');
-    throw new ConfigError(`invalid configuration — ${details}`);
-  }
-  return deepFreeze(result.data);
-}
+): Readonly<z.infer<TSchema>> {}
 
 function camelize(segment: string): string {
killedBy: buildConfig parses defaults into a typed config
statusReason: Cannot read properties of undefined (reading 'server')

[Killed] ArrowFunction
src/index.ts:52:5
   sources: readonly PlainObject[],
 ): Readonly<z.infer<TSchema>> {
   const merged = sources.reduce<PlainObject>(
-    (accumulated, source) => deepMerge(accumulated, source),
+    () => undefined,
     {},
   );
killedBy: buildConfig parses defaults into a typed config
statusReason: invalid configuration — : Invalid input: expected object, received undefined

[Killed] ConditionalExpression
src/index.ts:56:7
     {},
   );
   const result = schema.safeParse(merged);
-  if (!result.success) {
+  if (true) {
     const details = result.error.issues
       .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
killedBy: buildConfig parses defaults into a typed config
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
src/index.ts:56:7
     {},
   );
   const result = schema.safeParse(merged);
-  if (!result.success) {
+  if (result.success) {
     const details = result.error.issues
       .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
killedBy: buildConfig parses defaults into a typed config
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] ArrowFunction
src/index.ts:58:12
   const result = schema.safeParse(merged);
   if (!result.success) {
     const details = result.error.issues
-      .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
+      .map(() => undefined)
       .join('; ');
     throw new ConfigError(`invalid configuration — ${details}`);
killedBy: buildConfig fails fast with the offending path when validation fails
statusReason: expected [Function] to throw error matching /server\.port/ but got 'invalid configuration — '

[Killed] StringLiteral
src/index.ts:58:23
   const result = schema.safeParse(merged);
   if (!result.success) {
     const details = result.error.issues
-      .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
+      .map((issue) => ``)
       .join('; ');
     throw new ConfigError(`invalid configuration — ${details}`);
killedBy: buildConfig fails fast with the offending path when validation fails
statusReason: expected [Function] to throw error matching /server\.port/ but got 'invalid configuration — '

[Survived] StringLiteral
src/index.ts:59:13
   if (!result.success) {
     const details = result.error.issues
       .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
-      .join('; ');
+      .join("");
     throw new ConfigError(`invalid configuration — ${details}`);
   }

[Killed] StringLiteral
src/index.ts:60:27
     const details = result.error.issues
       .map((issue) => `${issue.path.join('.')}: ${issue.message}`)
       .join('; ');
-    throw new ConfigError(`invalid configuration — ${details}`);
+    throw new ConfigError(``);
   }
   return deepFreeze(result.data);
killedBy: buildConfig fails fast with the offending path when validation fails
statusReason: expected [Function] to throw error matching /server\.port/ but got ''

[Killed] BlockStatement
src/index.ts:65:44
   return deepFreeze(result.data);
 }
 
-function camelize(segment: string): string {
-  return segment
-    .toLowerCase()
-    .replace(/_+(.)/gu, (_match, letter: string) => letter.toUpperCase());
-}
+function camelize(segment: string): string {}
 
 /**
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { undefined: { undefined: 'Govori' } } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] MethodExpression
src/index.ts:66:10
 }
 
 function camelize(segment: string): string {
-  return segment
-    .toLowerCase()
+  return segment.toUpperCase()
     .replace(/_+(.)/gu, (_match, letter: string) => letter.toUpperCase());
 }
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { SERVER: { PORT: '8080' }, …(1) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] ArrowFunction
src/index.ts:68:25
 function camelize(segment: string): string {
   return segment
     .toLowerCase()
-    .replace(/_+(.)/gu, (_match, letter: string) => letter.toUpperCase());
+    .replace(/_+(.)/gu, () => undefined);
 }
 
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { server: { port: '8080' }, …(1) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] MethodExpression
src/index.ts:68:53
 function camelize(segment: string): string {
   return segment
     .toLowerCase()
-    .replace(/_+(.)/gu, (_match, letter: string) => letter.toUpperCase());
+    .replace(/_+(.)/gu, (_match, letter: string) => letter.toLowerCase());
 }
 
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { server: { port: '8080' }, …(1) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] BlockStatement
src/index.ts:80:16
 export function envSource(
   env: Readonly<Record<string, string | undefined>>,
   prefix: string,
-): PlainObject {
-  const source: PlainObject = {};
-  for (const [name, value] of Object.entries(env)) {
-    if (!name.startsWith(prefix) || value === undefined) {
-      continue;
-    }
-    const path = name.slice(prefix.length).split('__').map(camelize);
-    let node = source;
-    path.forEach((segment, index) => {
-      if (index === path.length - 1) {
-        node[segment] = value;
-        return;
-      }
-      const existing = node[segment];
-      const child = isPlainObject(existing) ? existing : {};
-      node[segment] = child;
-      node = child;
-    });
-  }
-  return source;
-}
+): PlainObject {}
 
 export interface FlagDefinition {
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected undefined to deeply equal { server: { port: '8080' }, …(1) }

[Killed] BlockStatement
src/index.ts:82:52
   prefix: string,
 ): PlainObject {
   const source: PlainObject = {};
-  for (const [name, value] of Object.entries(env)) {
-    if (!name.startsWith(prefix) || value === undefined) {
-      continue;
-    }
-    const path = name.slice(prefix.length).split('__').map(camelize);
-    let node = source;
-    path.forEach((segment, index) => {
-      if (index === path.length - 1) {
-        node[segment] = value;
-        return;
-      }
-      const existing = node[segment];
-      const child = isPlainObject(existing) ? existing : {};
-      node[segment] = child;
-      node = child;
-    });
-  }
+  for (const [name, value] of Object.entries(env)) {}
   return source;
 }
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected {} to deeply equal { server: { port: '8080' }, …(1) }

[Killed] MethodExpression
src/index.ts:83:10
 ): PlainObject {
   const source: PlainObject = {};
   for (const [name, value] of Object.entries(env)) {
-    if (!name.startsWith(prefix) || value === undefined) {
+    if (!name.endsWith(prefix) || value === undefined) {
       continue;
     }
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected {} to deeply equal { server: { port: '8080' }, …(1) }

[Killed] BlockStatement
src/index.ts:83:58
 ): PlainObject {
   const source: PlainObject = {};
   for (const [name, value] of Object.entries(env)) {
-    if (!name.startsWith(prefix) || value === undefined) {
-      continue;
-    }
+    if (!name.startsWith(prefix) || value === undefined) {}
     const path = name.slice(prefix.length).split('__').map(camelize);
     let node = source;
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { server: { port: '8080' }, …(2) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] MethodExpression
src/index.ts:86:18
     if (!name.startsWith(prefix) || value === undefined) {
       continue;
     }
-    const path = name.slice(prefix.length).split('__').map(camelize);
+    const path = name.split('__').map(camelize);
     let node = source;
     path.forEach((segment, index) => {
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { Object (glottyServer, glottyBrand) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] BlockStatement
src/index.ts:88:38
     }
     const path = name.slice(prefix.length).split('__').map(camelize);
     let node = source;
-    path.forEach((segment, index) => {
-      if (index === path.length - 1) {
-        node[segment] = value;
-        return;
-      }
-      const existing = node[segment];
-      const child = isPlainObject(existing) ? existing : {};
-      node[segment] = child;
-      node = child;
-    });
+    path.forEach((segment, index) => {});
   }
   return source;
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected {} to deeply equal { server: { port: '8080' }, …(1) }

[Killed] ArithmeticOperator
src/index.ts:89:21
     const path = name.slice(prefix.length).split('__').map(camelize);
     let node = source;
     path.forEach((segment, index) => {
-      if (index === path.length - 1) {
+      if (index === path.length + 1) {
         node[segment] = value;
         return;
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { server: { port: {} }, …(1) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] EqualityOperator
src/index.ts:89:11
     const path = name.slice(prefix.length).split('__').map(camelize);
     let node = source;
     path.forEach((segment, index) => {
-      if (index === path.length - 1) {
+      if (index !== path.length - 1) {
         node[segment] = value;
         return;
killedBy: envSource converts prefixed variables into a nested partial, camelizing keys
statusReason: expected { server: '8080', port: {}, …(2) } to deeply equal { server: { port: '8080' }, …(1) }

[Killed] BlockStatement
src/index.ts:148:73
 };
 
 /** True when the viewer's ring reaches the flag's target ring. */
-function ringSatisfied(target: TargetRole, viewer: ViewerRole): boolean {
-  return viewerRank[viewer] >= targetRank[target];
-}
+function ringSatisfied(target: TargetRole, viewer: ViewerRole): boolean {}
 
 /**
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/index.ts:149:10
 
 /** True when the viewer's ring reaches the flag's target ring. */
 function ringSatisfied(target: TargetRole, viewer: ViewerRole): boolean {
-  return viewerRank[viewer] >= targetRank[target];
+  return viewerRank[viewer] < targetRank[target];
 }
 
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/index.ts:149:10
 
 /** True when the viewer's ring reaches the flag's target ring. */
 function ringSatisfied(target: TargetRole, viewer: ViewerRole): boolean {
-  return viewerRank[viewer] >= targetRank[target];
+  return viewerRank[viewer] > targetRank[target];
 }
 
killedBy: resolveFlags shows an all-ring flag to every viewer, anonymous included
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/index.ts:158:64
  * (ADR 0025).
  */
 export function defineFlags<T extends FlagDefinitions>(definitions: T): T {
-  for (const [key, definition] of Object.entries(definitions)) {
-    for (const requirement of definition.requires ?? []) {
-      if (!(requirement in definitions)) {
-        throw new ConfigError(
-          `flag "${key}" requires unknown flag "${requirement}"`,
-        );
-      }
-    }
-  }
+  for (const [key, definition] of Object.entries(definitions)) {}
   const visiting = new Set<string>();
   const visited = new Set<string>();
killedBy: defineFlags rejects a requirement on an unknown flag at definition time
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/index.ts:159:58
  */
 export function defineFlags<T extends FlagDefinitions>(definitions: T): T {
   for (const [key, definition] of Object.entries(definitions)) {
-    for (const requirement of definition.requires ?? []) {
-      if (!(requirement in definitions)) {
-        throw new ConfigError(
-          `flag "${key}" requires unknown flag "${requirement}"`,
-        );
-      }
-    }
+    for (const requirement of definition.requires ?? []) {}
   }
   const visiting = new Set<string>();
killedBy: defineFlags rejects a requirement on an unknown flag at definition time
statusReason: expected function to throw an error, but it didn't

[Survived] LogicalOperator
src/index.ts:159:31
  */
 export function defineFlags<T extends FlagDefinitions>(definitions: T): T {
   for (const [key, definition] of Object.entries(definitions)) {
-    for (const requirement of definition.requires ?? []) {
+    for (const requirement of definition.requires && []) {
       if (!(requirement in definitions)) {
         throw new ConfigError(

[Killed] ConditionalExpression
src/index.ts:160:11
 export function defineFlags<T extends FlagDefinitions>(definitions: T): T {
   for (const [key, definition] of Object.entries(definitions)) {
     for (const requirement of definition.requires ?? []) {
-      if (!(requirement in definitions)) {
+      if (false) {
         throw new ConfigError(
           `flag "${key}" requires unknown flag "${requirement}"`,
killedBy: defineFlags rejects a requirement on an unknown flag at definition time
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/index.ts:160:42
 export function defineFlags<T extends FlagDefinitions>(definitions: T): T {
   for (const [key, definition] of Object.entries(definitions)) {
     for (const requirement of definition.requires ?? []) {
-      if (!(requirement in definitions)) {
-        throw new ConfigError(
-          `flag "${key}" requires unknown flag "${requirement}"`,
-        );
-      }
+      if (!(requirement in definitions)) {}
     }
   }
killedBy: defineFlags rejects a requirement on an unknown flag at definition time
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/index.ts:169:40
   }
   const visiting = new Set<string>();
   const visited = new Set<string>();
-  const visit = (key: string): void => {
-    if (visited.has(key)) {
-      return;
-    }
-    if (visiting.has(key)) {
-      throw new ConfigError(`flag dependency cycle involving "${key}"`);
-    }
-    visiting.add(key);
-    for (const requirement of definitions[key]?.requires ?? []) {
-      visit(requirement);
-    }
-    visiting.delete(key);
-    visited.add(key);
-  };
+  const visit = (key: string): void => {};
   for (const key of Object.keys(definitions)) {
     visit(key);
killedBy: defineFlags rejects dependency cycles at definition time
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/index.ts:170:9
   const visiting = new Set<string>();
   const visited = new Set<string>();
   const visit = (key: string): void => {
-    if (visited.has(key)) {
+    if (true) {
       return;
     }
killedBy: defineFlags rejects dependency cycles at definition time
statusReason: expected [Function] to throw an error

[Survived] BlockStatement
src/index.ts:170:27
   const visiting = new Set<string>();
   const visited = new Set<string>();
   const visit = (key: string): void => {
-    if (visited.has(key)) {
-      return;
-    }
+    if (visited.has(key)) {}
     if (visiting.has(key)) {
       throw new ConfigError(`flag dependency cycle involving "${key}"`);

[Timeout] BlockStatement
src/index.ts:173:28
     if (visited.has(key)) {
       return;
     }
-    if (visiting.has(key)) {
-      throw new ConfigError(`flag dependency cycle involving "${key}"`);
-    }
+    if (visiting.has(key)) {}
     visiting.add(key);
     for (const requirement of definitions[key]?.requires ?? []) {

[Timeout] ConditionalExpression
src/index.ts:173:9
     if (visited.has(key)) {
       return;
     }
-    if (visiting.has(key)) {
+    if (false) {
       throw new ConfigError(`flag dependency cycle involving "${key}"`);
     }

[Killed] BlockStatement
src/index.ts:177:65
       throw new ConfigError(`flag dependency cycle involving "${key}"`);
     }
     visiting.add(key);
-    for (const requirement of definitions[key]?.requires ?? []) {
-      visit(requirement);
-    }
+    for (const requirement of definitions[key]?.requires ?? []) {}
     visiting.delete(key);
     visited.add(key);
killedBy: defineFlags rejects dependency cycles at definition time
statusReason: expected [Function] to throw an error

[Survived] OptionalChaining
src/index.ts:177:31
       throw new ConfigError(`flag dependency cycle involving "${key}"`);
     }
     visiting.add(key);
-    for (const requirement of definitions[key]?.requires ?? []) {
+    for (const requirement of definitions[key].requires ?? []) {
       visit(requirement);
     }

[Killed] BlockStatement
src/index.ts:183:47
     visiting.delete(key);
     visited.add(key);
   };
-  for (const key of Object.keys(definitions)) {
-    visit(key);
-  }
+  for (const key of Object.keys(definitions)) {}
   return definitions;
 }
killedBy: defineFlags rejects dependency cycles at definition time
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/index.ts:201:41
   state: Readonly<Record<string, FlagState>>,
   viewerRole: ViewerRole,
 ): Readonly<Record<keyof T & string, ResolvedFlag>> {
-  for (const key of Object.keys(state)) {
-    if (!(key in definitions)) {
-      throw new ConfigError(`state for unknown flag "${key}"`);
-    }
-  }
+  for (const key of Object.keys(state)) {}
 
   const effectiveMemo = new Map<string, boolean>();
killedBy: resolveFlags rejects state keys that were never defined
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/index.ts:202:9
   viewerRole: ViewerRole,
 ): Readonly<Record<keyof T & string, ResolvedFlag>> {
   for (const key of Object.keys(state)) {
-    if (!(key in definitions)) {
+    if (true) {
       throw new ConfigError(`state for unknown flag "${key}"`);
     }
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: state for unknown flag "accounts"

[Killed] BlockStatement
src/index.ts:202:32
   viewerRole: ViewerRole,
 ): Readonly<Record<keyof T & string, ResolvedFlag>> {
   for (const key of Object.keys(state)) {
-    if (!(key in definitions)) {
-      throw new ConfigError(`state for unknown flag "${key}"`);
-    }
+    if (!(key in definitions)) {}
   }
 
killedBy: resolveFlags rejects state keys that were never defined
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/index.ts:203:29
 ): Readonly<Record<keyof T & string, ResolvedFlag>> {
   for (const key of Object.keys(state)) {
     if (!(key in definitions)) {
-      throw new ConfigError(`state for unknown flag "${key}"`);
+      throw new ConfigError(``);
     }
   }

[Killed] BlockStatement
src/index.ts:208:49
   }
 
   const effectiveMemo = new Map<string, boolean>();
-  const isEffective = (key: string): boolean => {
-    const memo = effectiveMemo.get(key);
-    if (memo !== undefined) {
-      return memo;
-    }
-    const stored = state[key];
-    const enabled = stored?.enabled ?? false;
-    const targetRole = stored?.targetRole ?? 'all';
-    const requires = definitions[key]?.requires ?? [];
-    const effective =
-      enabled &&
-      ringSatisfied(targetRole, viewerRole) &&
-      requires.every(isEffective);
-    effectiveMemo.set(key, effective);
-    return effective;
-  };
+  const isEffective = (key: string): boolean => {};
 
   const transitiveRequires = (key: string): string[] => {
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/index.ts:210:9
   const effectiveMemo = new Map<string, boolean>();
   const isEffective = (key: string): boolean => {
     const memo = effectiveMemo.get(key);
-    if (memo !== undefined) {
+    if (memo === undefined) {
       return memo;
     }
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/index.ts:210:9
   const effectiveMemo = new Map<string, boolean>();
   const isEffective = (key: string): boolean => {
     const memo = effectiveMemo.get(key);
-    if (memo !== undefined) {
+    if (true) {
       return memo;
     }
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/index.ts:214:40
       return memo;
     }
     const stored = state[key];
-    const enabled = stored?.enabled ?? false;
+    const enabled = stored?.enabled ?? true;
     const targetRole = stored?.targetRole ?? 'all';
     const requires = definitions[key]?.requires ?? [];
killedBy: resolveFlags treats flags missing from the state as disabled
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/index.ts:214:21
       return memo;
     }
     const stored = state[key];
-    const enabled = stored?.enabled ?? false;
+    const enabled = stored?.enabled && false;
     const targetRole = stored?.targetRole ?? 'all';
     const requires = definitions[key]?.requires ?? [];
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/index.ts:215:24
     }
     const stored = state[key];
     const enabled = stored?.enabled ?? false;
-    const targetRole = stored?.targetRole ?? 'all';
+    const targetRole = stored?.targetRole && 'all';
     const requires = definitions[key]?.requires ?? [];
     const effective =
killedBy: resolveFlags shows a reviewer-ring flag to reviewers and admins but no lower
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
src/index.ts:215:24
     }
     const stored = state[key];
     const enabled = stored?.enabled ?? false;
-    const targetRole = stored?.targetRole ?? 'all';
+    const targetRole = stored.targetRole ?? 'all';
     const requires = definitions[key]?.requires ?? [];
     const effective =
killedBy: resolveFlags treats flags missing from the state as disabled
statusReason: Cannot read properties of undefined (reading 'targetRole')
