[Killed] LogicalOperator
src/index.ts:216:22
     const stored = state[key];
     const enabled = stored?.enabled ?? false;
     const targetRole = stored?.targetRole ?? 'all';
-    const requires = definitions[key]?.requires ?? [];
+    const requires = definitions[key]?.requires && [];
     const effective =
       enabled &&
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: Cannot read properties of undefined (reading 'every')

[Survived] OptionalChaining
src/index.ts:216:22
     const stored = state[key];
     const enabled = stored?.enabled ?? false;
     const targetRole = stored?.targetRole ?? 'all';
-    const requires = definitions[key]?.requires ?? [];
+    const requires = definitions[key].requires ?? [];
     const effective =
       enabled &&

[Killed] ConditionalExpression
src/index.ts:218:7
     const targetRole = stored?.targetRole ?? 'all';
     const requires = definitions[key]?.requires ?? [];
     const effective =
-      enabled &&
-      ringSatisfied(targetRole, viewerRole) &&
-      requires.every(isEffective);
+      true;
     effectiveMemo.set(key, effective);
     return effective;
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/index.ts:218:7
     const targetRole = stored?.targetRole ?? 'all';
     const requires = definitions[key]?.requires ?? [];
     const effective =
-      enabled &&
-      ringSatisfied(targetRole, viewerRole) &&
+      true &&
       requires.every(isEffective);
     effectiveMemo.set(key, effective);
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/index.ts:220:7
     const effective =
       enabled &&
       ringSatisfied(targetRole, viewerRole) &&
-      requires.every(isEffective);
+      requires.some(isEffective);
     effectiveMemo.set(key, effective);
     return effective;
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/index.ts:225:57
     return effective;
   };
 
-  const transitiveRequires = (key: string): string[] => {
-    const collected: string[] = [];
-    const walk = (current: string): void => {
-      for (const requirement of definitions[current]?.requires ?? []) {
-        if (!collected.includes(requirement)) {
-          walk(requirement);
-          collected.push(requirement);
-        }
-      }
-    };
-    walk(key);
-    return collected;
-  };
+  const transitiveRequires = (key: string): string[] => {};
 
   const resolved: Record<string, ResolvedFlag> = {};
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/index.ts:227:45
 
   const transitiveRequires = (key: string): string[] => {
     const collected: string[] = [];
-    const walk = (current: string): void => {
-      for (const requirement of definitions[current]?.requires ?? []) {
-        if (!collected.includes(requirement)) {
-          walk(requirement);
-          collected.push(requirement);
-        }
-      }
-    };
+    const walk = (current: string): void => {};
     walk(key);
     return collected;
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected [] to deeply equal [ 'audio' ]

[Killed] LogicalOperator
src/index.ts:228:33
   const transitiveRequires = (key: string): string[] => {
     const collected: string[] = [];
     const walk = (current: string): void => {
-      for (const requirement of definitions[current]?.requires ?? []) {
+      for (const requirement of definitions[current]?.requires && []) {
         if (!collected.includes(requirement)) {
           walk(requirement);
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/index.ts:228:71
   const transitiveRequires = (key: string): string[] => {
     const collected: string[] = [];
     const walk = (current: string): void => {
-      for (const requirement of definitions[current]?.requires ?? []) {
-        if (!collected.includes(requirement)) {
-          walk(requirement);
-          collected.push(requirement);
-        }
-      }
+      for (const requirement of definitions[current]?.requires ?? []) {}
     };
     walk(key);
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected [] to deeply equal [ 'audio' ]

[Killed] ConditionalExpression
src/index.ts:229:13
     const collected: string[] = [];
     const walk = (current: string): void => {
       for (const requirement of definitions[current]?.requires ?? []) {
-        if (!collected.includes(requirement)) {
+        if (true) {
           walk(requirement);
           collected.push(requirement);
killedBy: resolveFlags reports a shared ancestor once in a diamond dependency
statusReason: expected [ 'base', 'left', 'base', 'right' ] to deeply equal [ 'base', 'left', 'right' ]

[Killed] BlockStatement
src/index.ts:229:47
     const collected: string[] = [];
     const walk = (current: string): void => {
       for (const requirement of definitions[current]?.requires ?? []) {
-        if (!collected.includes(requirement)) {
-          walk(requirement);
-          collected.push(requirement);
-        }
+        if (!collected.includes(requirement)) {}
       }
     };
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected [] to deeply equal [ 'audio' ]

[Killed] BlockStatement
src/index.ts:240:47
   };
 
   const resolved: Record<string, ResolvedFlag> = {};
-  for (const key of Object.keys(definitions)) {
-    resolved[key] = {
-      effective: isEffective(key),
-      suppressedBy: transitiveRequires(key).filter(
-        (requirement) => !isEffective(requirement),
-      ),
-    };
-  }
+  for (const key of Object.keys(definitions)) {}
   return deepFreeze(resolved as Record<keyof T & string, ResolvedFlag>);
 }
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: Cannot read properties of undefined (reading 'effective')

[Killed] ObjectLiteral
src/index.ts:241:21
 
   const resolved: Record<string, ResolvedFlag> = {};
   for (const key of Object.keys(definitions)) {
-    resolved[key] = {
-      effective: isEffective(key),
-      suppressedBy: transitiveRequires(key).filter(
-        (requirement) => !isEffective(requirement),
-      ),
-    };
+    resolved[key] = {};
   }
   return deepFreeze(resolved as Record<keyof T & string, ResolvedFlag>);
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/index.ts:243:21
   for (const key of Object.keys(definitions)) {
     resolved[key] = {
       effective: isEffective(key),
-      suppressedBy: transitiveRequires(key).filter(
-        (requirement) => !isEffective(requirement),
-      ),
+      suppressedBy: transitiveRequires(key),
     };
   }
killedBy: resolveFlags treats flags missing from the state as disabled
statusReason: expected [ 'accounts' ] to deeply equal []

[Killed] ArrowFunction
src/index.ts:244:9
     resolved[key] = {
       effective: isEffective(key),
       suppressedBy: transitiveRequires(key).filter(
-        (requirement) => !isEffective(requirement),
+        () => undefined,
       ),
     };
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected [] to deeply equal [ 'audio' ]

[Killed] BooleanLiteral
src/index.ts:244:26
     resolved[key] = {
       effective: isEffective(key),
       suppressedBy: transitiveRequires(key).filter(
-        (requirement) => !isEffective(requirement),
+        (requirement) => isEffective(requirement),
       ),
     };
killedBy: resolveFlags enables a flag only when all transitive requirements are enabled
statusReason: expected [] to deeply equal [ 'audio' ]
